In [1]:
import sqlite3

In [2]:
cnct = sqlite3.connect('sample_SQL_database.db')

In [3]:
cursor = cnct.cursor()

In [4]:
type(cnct)

sqlite3.Connection

In [5]:
type(cursor)

sqlite3.Cursor

In [6]:
table = """ CREATE TABLE INPATIENT (
            Patient_FirstName CHAR(25) NOT NULL,
            Patient_MI CHAR(25),
            Patient_LastName CHAR(25) NOT NULL,
            Patient_DOB CHAR(25) NOT NULL,
            Admission_Date CHAR(25)
        ); """

In [7]:
cursor.execute(table)

In [74]:
def query(text):
    data = cursor.execute(text)
    for row in data:
        print(row)
    return data

In [14]:
insert_data = """ INSERT INTO inpatient (Patient_FirstName, Patient_LastName, Patient_DOB) VALUES ('John','Doe','01/21/1984'); """

In [15]:
query(insert_data)

In [16]:
query("""SELECT * FROM inpatient;""")

('John', None, 'Doe', '01/21/1984', None)

In [58]:
def insert_entry(tblname, fname, lname, DOB, **kwargs):
    mi = kwargs.get('mi', None)
    doa = kwargs.get('doa', None)
    text= f"INSERT INTO {tblname} (Patient_FirstName, Patient_LastName, Patient_DOB) VALUES ('{fname}','{lname}','{DOB}');"
    cursor.execute(text)

In [59]:
from random import choice, randint
from datetime import date

In [60]:
def randDOB():
    y = randint(1900,2024)
    m = randint(1,12)
    if m == 2:
        d = randint(1,28)
    elif m in [1,3,5,7,9,10,12]:
        d = randint(1,31)
    else:
        d = randint(1,30)
    return f"{m:02d}/{d:02d}/{y}"

In [61]:
first_names = ["James", "Mary", "John", "Patricia", "Robert", "Jennifer", "Michael", "Linda", "William", "Elizabeth"]
last_names = ["Smith", "Johnson", "Williams", "Jones", "Brown", "Davis", "Miller", "Wilson", "Moore", "Taylor"]

def randfn():
    return choice(first_names)
def randln():
    return choice(last_names)

def randentry():
    return (randfn(),randln(),randDOB())

In [62]:
randentry()

('Patricia', 'Miller', '10/20/1962')

In [66]:
def randinsert(tblname):
    f,l,d = randentry()
    insert_entry(tblname, f, l, d)
    print(f"Inserted {f},{l},{d} into {tblname}")
    # print(f"INSERT INTO {tblname}(Patient_FirstName, Patient_LastName, Patient_DOB) VALUES ('{f}','{l}','{d}');""")

In [67]:
randinsert('inpatient')

Inserted Patricia,Wilson,01/15/1932 into inpatient

In [68]:
query("SELECT * FROM inpatient")

('John', None, 'Doe', '01/21/1984', None)
('Mary', None, 'Johnson', '02/23/1924', None)
('Patricia', None, 'Wilson', '01/15/1932', None)

In [72]:
import pandas as pd

In [75]:
data = query("SELECT * FROM inpatient")

('John', None, 'Doe', '01/21/1984', None)
('Mary', None, 'Johnson', '02/23/1924', None)
('Patricia', None, 'Wilson', '01/15/1932', None)

In [85]:
pd.read_sql_query("SELECT * FROM inpatient", cnct)

  Patient_FirstName Patient_MI Patient_LastName Patient_DOB Admission_Date
0              John       None              Doe  01/21/1984           None
1              Mary       None          Johnson  02/23/1924           None
2          Patricia       None           Wilson  01/15/1932           None

In [92]:
def querypd(cnx = cnct):
    text = input("Enter SQL Code: ")
    return pd.read_sql_query(text, cnx)

In [93]:
querypd()

Enter SQL Code:  SELECT *  FROM inpatient

  Patient_FirstName Patient_MI Patient_LastName Patient_DOB Admission_Date
0              John       None              Doe  01/21/1984           None
1              Mary       None          Johnson  02/23/1924           None
2          Patricia       None           Wilson  01/15/1932           None

In [94]:
querypd()

Enter SQL Code:  SELECT Patient_FirstName FROM inpatient;

  Patient_FirstName
0              John
1              Mary
2          Patricia

In [105]:
for i in range(100):
    randinsert('inpatient')

Inserted William,Miller,10/21/1967 into inpatient
Inserted Robert,Williams,08/27/1994 into inpatient
Inserted Patricia,Wilson,05/10/2018 into inpatient
Inserted John,Taylor,02/07/1995 into inpatient
Inserted Jennifer,Johnson,07/26/2012 into inpatient
Inserted Jennifer,Jones,08/03/1902 into inpatient
Inserted Patricia,Wilson,12/05/1935 into inpatient
Inserted Robert,Wilson,05/27/1949 into inpatient
Inserted Patricia,Miller,12/09/1961 into inpatient
Inserted Patricia,Miller,02/21/1933 into inpatient
Inserted Jennifer,Wilson,11/21/1953 into inpatient
Inserted James,Davis,02/27/1959 into inpatient
Inserted Elizabeth,Taylor,10/24/1974 into inpatient
Inserted James,Wilson,07/08/1984 into inpatient
Inserted Elizabeth,Johnson,11/22/1998 into inpatient
Inserted Michael,Taylor,07/24/1956 into inpatient
Inserted Linda,Miller,03/17/1930 into inpatient
Inserted James,Miller,07/13/1993 into inpatient
Inserted Patricia,Johnson,03/25/1907 into inpatient
Inserted Robert,Moore,06/03/1900 into inpatient
Inserted Michael,Moore,06/23/1949 into inpatient
Inserted Mary,Taylor,09/28/1917 into inpatient
Inserted Patricia,Williams,04/15/1917 into inpatient
Inserted Jennifer,Miller,10/03/2014 into inpatient
Inserted Linda,Davis,11/09/2015 into inpatient
Inserted John,Jones,02/23/2005 into inpatient
Inserted Jennifer,Jones,01/07/1951 into inpatient
Inserted Mary,Davis,07/24/1935 into inpatient
Inserted William,Taylor,06/17/2009 into inpatient
Inserted Michael,Davis,10/02/1990 into inpatient
Inserted Michael,Taylor,04/09/2005 into inpatient
Inserted Michael,Williams,02/02/1965 into inpatient
Inserted Michael,Jones,08/19/2010 into inpatient
Inserted James,Johnson,05/17/1917 into inpatient
Inserted Robert,Taylor,02/09/1914 into inpatient
Inserted James,Williams,04/15/2016 into inpatient
Inserted James,Brown,08/12/1942 into inpatient
Inserted William,Smith,07/03/1980 into inpatient
Inserted Robert,Davis,02/03/2002 into inpatient
Inserted Jennifer,Miller,10/13/1948 into inpatient
Inserted Jennifer,Moore,10/01/2021 into inpatient
Inserted Mary,Miller,10/19/1994 into inpatient
Inserted Michael,Jones,03/12/1942 into inpatient
Inserted Michael,Taylor,01/21/1967 into inpatient
Inserted James,Smith,01/15/1968 into inpatient
Inserted Michael,Brown,11/29/1903 into inpatient
Inserted Mary,Johnson,07/03/1918 into inpatient
Inserted Linda,Williams,07/08/1902 into inpatient
Inserted Patricia,Johnson,06/16/1925 into inpatient
Inserted Elizabeth,Williams,05/26/2008 into inpatient
Inserted William,Davis,06/17/1993 into inpatient
Inserted Elizabeth,Taylor,12/02/2007 into inpatient
Inserted John,Smith,07/03/1967 into inpatient
Inserted James,Jones,11/05/1990 into inpatient
Inserted Patricia,Taylor,03/02/1931 into inpatient
Inserted Jennifer,Moore,04/27/1926 into inpatient
Inserted William,Jones,06/15/1998 into inpatient
Inserted Jennifer,Miller,01/28/2020 into inpatient
Inserted Patricia,Jones,01/26/1929 into inpatient
Inserted Linda,Williams,01/18/2024 into inpatient
Inserted Patricia,Davis,12/18/1930 into inpatient
Inserted James,Smith,03/11/1964 into inpatient
Inserted Mary,Brown,11/19/1954 into inpatient
Inserted Linda,Brown,11/29/1997 into inpatient
Inserted James,Williams,03/27/2014 into inpatient
Inserted William,Taylor,09/26/1992 into inpatient
Inserted Jennifer,Johnson,04/12/2001 into inpatient
Inserted Linda,Wilson,01/02/1980 into inpatient
Inserted Linda,Moore,07/09/1945 into inpatient
Inserted John,Wilson,11/21/1905 into inpatient
Inserted Michael,Brown,05/05/1950 into inpatient
Inserted Mary,Miller,01/28/1991 into inpatient
Inserted Michael,Jones,05/16/1965 into inpatient
Inserted Elizabeth,Smith,11/20/1984 into inpatient
Inserted John,Wilson,01/22/1945 into inpatient
Inserted Patricia,Taylor,01/30/1993 into inpatient
Inserted John,Johnson,06/15/1921 into inpatient
Inserted Robert,Williams,05/30/1937 into inpatient
Inserted John,Davis,01/04/1914 into inpatient
Inserted John,Moore,05/31/1933 into inpatient
Inserted Elizabeth,Davis,04/18/1922 into inpatient
Inserted Jennifer,Williams,03/16/1926 into inpatient
Inserted Michael,Moore,02/12/1915 into inpatient
Inserted Michael,Wilson,04/24/1971 into inpatient
Inserted Robert,Davis,03/31/2010 into inpatient
Inserted Mary,Williams,10/14/1955 into inpatient
Inserted Elizabeth,Moore,10/17/1989 into inpatient
Inserted Robert,Moore,06/25/1960 into inpatient
Inserted Elizabeth,Miller,05/24/1906 into inpatient
Inserted William,Williams,07/28/1901 into inpatient
Inserted Linda,Williams,08/22/2019 into inpatient
Inserted John,Williams,01/20/1906 into inpatient
Inserted John,Wilson,02/17/1904 into inpatient
Inserted Elizabeth,Johnson,11/29/1934 into inpatient
Inserted James,Smith,04/22/1998 into inpatient
Inserted Mary,Taylor,05/02/1949 into inpatient
Inserted Jennifer,Wilson,10/29/2007 into inpatient
Inserted Elizabeth,Wilson,03/23/1920 into inpatient
Inserted Elizabeth,Brown,03/28/2022 into inpatient
Inserted Michael,Taylor,03/24/1905 into inpatient

In [106]:
querypd()

Enter SQL Code:  SELECT * FROM inpatient

   Patient_FirstName Patient_MI Patient_LastName Patient_DOB Admission_Date
0            William       None           Miller  10/21/1967           None
1             Robert       None         Williams  08/27/1994           None
2           Patricia       None           Wilson  05/10/2018           None
3               John       None           Taylor  02/07/1995           None
4           Jennifer       None          Johnson  07/26/2012           None
..               ...        ...              ...         ...            ...
95              Mary       None           Taylor  05/02/1949           None
96          Jennifer       None           Wilson  10/29/2007           None
97         Elizabeth       None           Wilson  03/23/1920           None
98         Elizabeth       None            Brown  03/28/2022           None
99           Michael       None           Taylor  03/24/1905           None

[100 rows x 5 columns]

In [107]:
df = querypd()

Enter SQL Code:  SELECT * FROM inpatient

In [111]:
df['Patient_DOB'] = pd.to_datetime(df['Patient_DOB'])
print(df)

   Patient_FirstName Patient_MI Patient_LastName Patient_DOB Admission_Date
0            William       None           Miller  1967-10-21           None
1             Robert       None         Williams  1994-08-27           None
2           Patricia       None           Wilson  2018-05-10           None
3               John       None           Taylor  1995-02-07           None
4           Jennifer       None          Johnson  2012-07-26           None
..               ...        ...              ...         ...            ...
95              Mary       None           Taylor  1949-05-02           None
96          Jennifer       None           Wilson  2007-10-29           None
97         Elizabeth       None           Wilson  1920-03-23           None
98         Elizabeth       None            Brown  2022-03-28           None
99           Michael       None           Taylor  1905-03-24           None

[100 rows x 5 columns]

In [113]:
df.to_sql('patients',cnct,if_exists='replace',index=False)

100

In [115]:
querypd()

Enter SQL Code:  SELECT * FROM patients ORDER BY Patient_DOB

   Patient_FirstName Patient_MI  ...          Patient_DOB Admission_Date
0             Robert       None  ...  1900-06-03 00:00:00           None
1            William       None  ...  1901-07-28 00:00:00           None
2              Linda       None  ...  1902-07-08 00:00:00           None
3           Jennifer       None  ...  1902-08-03 00:00:00           None
4            Michael       None  ...  1903-11-29 00:00:00           None
..               ...        ...  ...                  ...            ...
95             Linda       None  ...  2019-08-22 00:00:00           None
96          Jennifer       None  ...  2020-01-28 00:00:00           None
97          Jennifer       None  ...  2021-10-01 00:00:00           None
98         Elizabeth       None  ...  2022-03-28 00:00:00           None
99             Linda       None  ...  2024-01-18 00:00:00           None

[100 rows x 5 columns]